package com.github.niefy.modules.wx.config;

import com.alibaba.fastjson.JSON;
import com.github.niefy.common.exception.RRException;
import com.google.common.cache.Cache;
import com.google.common.cache.CacheBuilder;

import java.util.concurrent.ExecutionException;
import java.util.concurrent.TimeUnit;

/**
 * @author cuitpanfei
 */
public class WxMpHtmlParamsHolder {
    public static final Cache<String, Object> CACHE = CacheBuilder.newBuilder()
            .concurrencyLevel(Runtime.getRuntime().availableProcessors())
            .initialCapacity(200)
            .expireAfterWrite(1, TimeUnit.DAYS)
            .build();

    public static JSON loadArticleCategory() {
        try {
            return (JSON) CACHE.get("mp-article-category", () -> {
                String category = "[{\"title\":\"时事\",\"sublist\":[\"国家领导人\",\"反腐新闻\",\"官员任免\",\"台湾\",\"港澳\",\"新时代\",\"中国外交\",\"美国\",\"俄罗斯\",\"日本\",\"欧洲/欧盟\",\"东南亚\",\"中东\",\"朝韩\",\"美洲\",\"非洲\",\"亚洲\",\"国际组织\",\"其他\"]},{\"title\":\"社会\",\"sublist\":[\"民生\",\"民生政策\",\"法律法规\",\"法制纠纷\",\"事故灾害\",\"公益\",\"正能量\",\"校园新闻\",\"社区新闻\",\"奇闻趣事\",\"组织内部管理\",\"海外民生\",\"其他\"]},{\"title\":\"财经\",\"sublist\":[\"宏观经济\",\"产业经济\",\"投资/创业\",\"公司新闻\",\"财经人物\",\"理财投资技巧\",\"股票\",\"期货\",\"银行\",\"基金\",\"保险\",\"外汇\",\"债券\",\"信托\",\"贵金属\",\"能源\",\"数字货币\",\"收藏\",\"其他\"]},{\"title\":\"军事\",\"sublist\":[\"武器装备\",\"军用飞行器\",\"军事历史\",\"军情/军事新闻\",\"军事知识\",\"其他\"]},{\"title\":\"教育\",\"sublist\":[\"学前教育\",\"小学教育\",\"初中教育\",\"高中教育\",\"高等教育\",\"语言学习\",\"留学相关\",\"职业考试\",\"技能教育\",\"演讲\",\"其他\"]},{\"title\":\"体育\",\"sublist\":[\"NBA\",\"CBA\",\"篮球其他\",\"国际足球\",\"国内足球\",\"足球其他\",\"综合体育\",\"冬季项目\",\"大众体育\",\"户外运动\",\"极限运动\",\"大型赛事\",\"搏击\",\"精英体育\",\"彩票\",\"棋牌\",\"其他\"]},{\"title\":\"科技\",\"sublist\":[\"科技股公司\",\"科技创投\",\"科技大佬\",\"互联网坊间八卦\",\"内容产业\",\"互联网金融\",\"互联网+\",\"通信\",\"区块链\",\"前沿产业(云/AR/VR等)\",\"信息技术\",\"电商\",\"软件工具\",\"数码\",\"汽车科技\",\"科技奇趣\",\"航空航天/机械\",\"其他\"]},{\"title\":\"汽车\",\"sublist\":[\"汽车产业\",\"新车资讯\",\"汽车评测\",\"汽车导购\",\"车展资讯\",\"二手车\",\"保养/开车技巧\",\"汽车改装\",\"汽车模型\",\"其他\"]},{\"title\":\"科学\",\"sublist\":[\"天文宇宙\",\"地理\",\"动植物世界\",\"医学\",\"生物考古\",\"科普\",\"科幻\",\"科学实验\",\"其他\"]},{\"title\":\"房产\",\"sublist\":[\"房产政策\",\"房价走势\",\"买房相关\",\"卖房相关\",\"租房相关\",\"海外房产\",\"其他\"]},{\"title\":\"电影\",\"sublist\":[\"电影资讯\",\"电影解说/片段\",\"电影混剪\",\"预告花絮\",\"微电影\",\"其他\"]},{\"title\":\"电视剧\",\"sublist\":[\"预告资讯\",\"精彩片段\",\"电视剧解说\",\"自制混剪\",\"恶搞配音\",\"其他\"]},{\"title\":\"综艺\",\"sublist\":[\"内地综艺\",\"港台综艺\",\"韩国综艺\",\"日本综艺\",\"欧美综艺\",\"晚会盛典\",\"其他\"]},{\"title\":\"明星\",\"sublist\":[\"八卦\",\"内地明星\",\"港台明星\",\"日本明星\",\"韩国明星\",\"欧美明星\",\"其他地区明星\",\"明星直发\",\"其他\"]},{\"title\":\"音乐\",\"sublist\":[\"流行\",\"电子\",\"轻音乐\",\"民谣\",\"说唱\",\"摇滚\",\"爵士\",\"R&B\",\"布鲁斯\",\"古典\",\"网络歌曲\",\"其他\"]},{\"title\":\"动漫\",\"sublist\":[\"恋爱\",\"剧情\",\"日常\",\"恐怖\",\"犯罪\",\"悬疑\",\"武侠\",\"历史\",\"冒险\",\"动作\",\"竞技\",\"玄幻\",\"奇幻\",\"异能\",\"科幻\",\"原创短片\",\"盘点解读\",\"虚拟偶像\",\"声优资讯\",\"漫展资讯\",\"动漫壁纸\",\"cosplay\",\"鬼畜\",\"宅舞\",\"手绘\",\"MMD\",\"AMV/MAD/手书\",\"动漫音乐\",\"动漫相关资讯\",\"手办\",\"其他\"]},{\"title\":\"游戏\",\"sublist\":[\"手游\",\"小游戏\",\"主机游戏\",\"端游\",\"页游\",\"街机游戏\",\"便携游戏\",\"电竞赛事\",\"游戏展会\",\"游戏泛资讯\",\"其他\"]},{\"title\":\"时尚\",\"sublist\":[\"穿搭\",\"街拍\",\"美妆\",\"美体整形/医美\",\"时尚好物\",\"男士时尚\",\"时尚资讯/活动\",\"时尚大片\",\"其他\"]},{\"title\":\"健康\",\"sublist\":[\"养生保健\",\"健康科普知识\",\"心理健康\",\"饮食健康\",\"医疗\",\"药品\",\"疾病防治\",\"癌症\",\"口腔健康\",\"两性健康\",\"男性健康\",\"女性健康\",\"老人健康\",\"中医\",\"其他\"]},{\"title\":\"旅游\",\"sublist\":[\"自由行\",\"跟团游\",\"一日游/周末游\",\"亲子游\",\"定制游\",\"邮轮游\",\"穷游\",\"海岛\",\"其他\"]},{\"title\":\"美食\",\"sublist\":[\"探店攻略\",\"菜谱\",\"美食文化\",\"美食猎奇\",\"吃播\",\"其他\"]},{\"title\":\"生活\",\"sublist\":[\"生活百科\",\"生活方式\",\"日用家居\",\"购物信息\",\"生活记录\",\"其他\"]},{\"title\":\"摄影\",\"sublist\":[\"摄影作品\",\"摄影技术\",\"摄影器材\",\"后期处理\",\"其他\"]},{\"title\":\"宠物\",\"sublist\":[\"狗\",\"猫\",\"仓鼠\",\"兔子\",\"猪\",\"鱼\",\"鸟\",\"乌龟\",\"龙猫\",\"蛇\",\"蜥蜴\",\"蜘蛛\",\"其他\"]},{\"title\":\"职场\",\"sublist\":[\"职场经验\",\"求职面试\",\"商业管理\",\"创业指导\",\"网店经营\",\"其他\"]},{\"title\":\"育儿\",\"sublist\":[\"萌宝晒娃\",\"亲子成长\",\"备孕\",\"孕产\",\"产后\",\"饮食\",\"疾病防治\",\"护理发育\",\"母婴用品\",\"其他\"]},{\"title\":\"情感\",\"sublist\":[\"两性关系\",\"家庭关系\",\"单身\",\"人际关系\",\"其他\"]},{\"title\":\"心灵鸡汤\",\"sublist\":[\"人生感悟\",\"名人名言\",\"美文\",\"其他\"]},{\"title\":\"星座命理\",\"sublist\":[\"星座\",\"生肖\",\"命理\",\"风水\",\"相术\",\"血型\",\"塔罗牌\",\"测试\",\"其他\"]},{\"title\":\"小说\",\"sublist\":[\"东方玄幻\",\"都市小说\",\"仙侠武侠\",\"异界大陆\",\"异术超能\",\"西方奇幻\",\"同人文\",\"历史/历史架空\",\"游戏竞技\",\"科幻未来\",\"时空穿梭\",\"悬疑恐怖\",\"军事小说\",\"穿越架空\",\"豪门世家\",\"现代言情\",\"玄幻言情\",\"古代言情\",\"快穿小说\",\"宫闱宅斗\",\"仙侠奇缘\",\"异术超能\",\"种田文\",\"校园言情\",\"科幻神秘\",\"同人文\",\"其他\"]},{\"title\":\"曲艺\",\"sublist\":[\"相声\",\"小品\",\"评书\",\"京剧\",\"越剧\",\"秦腔\",\"昆曲\",\"豫剧\",\"粤剧\",\"潮剧\",\"黄梅戏\",\"其他\"]},{\"title\":\"文化\",\"sublist\":[\"文学\",\"绘画\",\"舞蹈\",\"音乐\",\"雕塑\",\"建筑\",\"戏剧\",\"工艺\",\"书法\",\"民俗\",\"哲学\",\"国学\",\"宗教\",\"收藏\",\"文物\",\"读书\",\"综合文化\",\"其他\"]},{\"title\":\"历史\",\"sublist\":[\"中国古代史\",\"中国近代史\",\"中国当代史\",\"党史\",\"世界史\",\"野史八卦\",\"历史考古\",\"其他\"]},{\"title\":\"三农\",\"sublist\":[\"农村\",\"农业\",\"农民\",\"其他\"]},{\"title\":\"广告创意\",\"sublist\":[\"创意广告\",\"公益广告\",\"品牌广告\",\"宣传短片\",\"其他\"]},{\"title\":\"纪录片\",\"sublist\":[\"美食纪录片\",\"自然纪录片\",\"科学纪录片\",\"历史纪录片\",\"旅游纪录片\",\"文化纪录片\",\"人物纪录片\",\"军事纪录片\",\"工业纪录片\",\"主旋律纪录片\",\"社会现实题材纪录片\"]},{\"title\":\"搞笑\",\"sublist\":[\"段子\",\"神回复/神操作\",\"糗事\",\"内涵图\",\"神剪辑\",\"整蛊/搞怪\",\"表演秀\",\"搞笑影视\",\"熊孩子\",\"爆笑动物\",\"其他\"]},{\"title\":\"壁纸头像\",\"sublist\":[\"表情包\",\"套图\",\"壁纸\",\"头像\",\"文字图\",\"其他\"]},{\"title\":\"其他\",\"sublist\":[]}]";
                return JSON.parse(category);
            });
        } catch (ExecutionException e) {
            throw new RRException("获取分类信息失败", e);
        }
    }
}
